app/views/fan_bases/_fan_base_music.html.erb


            <% unless current_cart.line_items.find_by_master_song_id(master_song.id).present? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 16 AND "line_items"."master_song_id" = 1 LIMIT 1