app/views/fan_bases/your_fan_bases.html.erb

<% if current_user.user_type == "music artist" %>
  <% unless current_user.fan_base.present? %>
---
SELECT "fan_bases".* FROM "fan_bases" WHERE "fan_bases"."user_id" = 1 LIMIT 1