app/views/carts/_cart.html.erb

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 1
---
<% unless cart.line_items.empty? %>