app/views/master_songs/_not_signed_in_master_song_info.html.erb

<% unless @master_song.price == 0.00 %>
	  <% unless current_cart.line_items.find_by_master_song_id(@master_song.id).present? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 6 AND "line_items"."master_song_id" = 1 LIMIT 1