app/views/master_songs/_signed_in_master_song_info.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1 AND "line_items"."master_song_id" = 1 LIMIT 1
---
	    <% unless @master_song.price == 0.00 %>
		  <% unless current_cart.line_items.find_by_master_song_id(@master_song.id).present? %>