app/views/master_songs/_song_feed_item.html.erb

          <div id="add-to-cart-<%= master_song.id %>">
         <% if current_cart.line_items.find_by_master_song_id(master_song.id).present? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 2 AND "line_items"."master_song_id" = 1 LIMIT 1

    </div>
    <% master_song.master_song_comments.limit(2).each do |comment| %>
---
SELECT "master_song_comments".* FROM "master_song_comments" WHERE "master_song_comments"."master_song_id" = 1 LIMIT 2