app/controllers/carts_controller.rb

  def show
    @cart = current_cart
    begin
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 20]]

  def destroy
    @cart = current_cart
    @line_items = @cart.line_items.all
    @cart.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 1]]