app/controllers/fan_bases_controller.rb

SELECT "master_songs".* FROM "master_songs" WHERE "master_songs"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = 1
SELECT "labels".* FROM "labels" WHERE "labels"."fan_base_id" = 1 LIMIT 1
---
  def show
    @fan_base = FanBase.find(params[:id])
    @master_songs = @fan_base.user.master_songs.all
    @label = @fan_base.label
    @albums = @fan_base.user.albums.all

INSERT INTO "fan_bases" ("created_at", "description", "fb_art_content_type", "fb_art_file_name", "fb_art_file_size", "fb_art_updated_at", "name", "slug", "status_message", "type_of_music_entity", "updated_at", "user_id", "verification") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @fan_base = current_user.build_fan_base(params[:fan_base])

    respond_to do |format|
      if @fan_base.save

SELECT "fan_bases".* FROM "fan_bases" WHERE "fan_bases"."user_id" = 1 LIMIT 1
---
  def your_fan_bases
    @fan_base_followings = current_user.fan_base_followings.all