app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    master_song = MasterSong.find(params[:master_song_id])
    @line_item = @cart.add_master_song(master_song.id)
    @master_song = master_song

    respond_to do |format|
      if @line_item.save
---
SELECT "master_songs".* FROM "master_songs" WHERE "master_songs"."id" = 1 LIMIT 1
INSERT INTO "line_items" ("cart_id", "created_at", "master_song_id", "price", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-12-21 06:23:01.496131' WHERE "line_items"."id" = 2