app/controllers/master_songs_controller.rb

SELECT "master_songs".* FROM "master_songs" ORDER BY created_at DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "master_songs"
---
  def index
    @newly_added_songs = MasterSong.newly.page(params[:page]).per(12)

SELECT "master_songs".* FROM "master_songs" ORDER BY song_up_votes_count DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "master_songs"
---
  def most_upvoted
    @upvoted = true
    @most_upvoted_songs = MasterSong.upvoted.page(params[:page]).per(12)

SELECT "master_songs".* FROM "master_songs" ORDER BY song_listens_count DESC LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "master_songs"
---
  def most_listened_to
    @most_listened = true
    @most_listened_to_songs = MasterSong.most_listened.page(params[:page]).per(12)

INSERT INTO "master_songs" ("album_id", "artist", "created_at", "ep_title", "length", "m_song_content_type", "m_song_file_name", "m_song_file_size", "m_song_fingerprint", "m_song_updated_at", "master_song_comments_count", "playable", "price", "release_date", "slug", "song_art_work_content_type", "song_art_work_file_name", "song_art_work_file_size", "song_art_work_updated_at", "song_listens_count", "song_up_votes_count", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @master_song = current_user.master_songs.build(params[:master_song])
    @fan_base = @master_song.user.fan_base
    respond_to do |format|
      if @master_song.save