app/controllers/master_song_relationships_controller.rb

  def create
    @master_song = MasterSong.find(params[:master_song_relationship][:owned_id])
---
SELECT "master_songs".* FROM "master_songs" WHERE "master_songs"."id" = ? LIMIT 1  [["id", "2"]]