app/controllers/song_listens_controller.rb

INSERT INTO "song_listens" ("created_at", "listenable_id", "listenable_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 21 Dec 2012 03:24:42 UTC +00:00], ["listenable_id", 1], ["listenable_type", "MasterSong"], ["updated_at", Fri, 21 Dec 2012 03:24:42 UTC +00:00], ["user_id", 1]]
---
  def create
  	@song_listen = current_user.song_listens.build(params[:song_listen]) do |sl|
      sl.listenable_id = params[:songid]
      sl.listenable_type = params[:songtype]
    end
  	@song_listen.save