app/controllers/song_up_votes_controller.rb

INSERT INTO "song_up_votes" ("created_at", "master_song_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Dec 2012 08:20:48 UTC +00:00], ["master_song_id", 1], ["updated_at", Fri, 21 Dec 2012 08:20:48 UTC +00:00], ["user_id", 1]]
SELECT "master_songs".* FROM "master_songs" WHERE "master_songs"."id" = 1 LIMIT 1
---
  def create
    @song_up_vote = current_user.song_up_votes.build(params[:song_up_upvote]) do |l|
      l.master_song_id = params[:master_song_id]
    end
    @song_up_vote.save
    @master_song = MasterSong.find_by_id(params[:master_song_id])