app/controllers/user_song_uploads_controller.rb

  def show
    @library = true
    @user_song_uploads = current_user.user_song_uploads.all
    @master_songs = current_user.master_song_ownings.all
    @master_song_relationships = current_user.master_song_relationships.all
    @favoritings = current_user.user_song_uploads.where(:favorite => true).size + current_user.master_song_relationships.where(:favorite => true).size
---
SELECT "user_song_uploads".* FROM "user_song_uploads" WHERE "user_song_uploads"."user_id" = 1
SELECT COUNT(*) FROM "user_song_uploads" WHERE "user_song_uploads"."user_id" = 1 AND "user_song_uploads"."favorite" = 't'