app/views/layouts/_cart_display.html.erb

<% else %>
  <% if current_cart.line_items.present? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 19